HOMEWORK 2 - Heather Turcios

# Solution for Exercise 2.5

In [1]:
temperatures = [-5.4, 1.0, -1.3, -4.8, 3.9, 0.1, -4.4, 4.0, -2.2, -3.9, 4.4,
                -2.5, -4.6, 5.1, 2.1, -2.4, 1.9, -3.3, -4.8, 1.0, -0.8, -2.8,
                -0.1, -4.7, -5.6, 2.6, -2.7, -4.6, 3.4, -0.4, -0.9, 3.1, 2.4,
                1.6, 4.2, 3.5, 2.6, 3.1, 2.2, 1.8, 3.3, 1.6, 1.5, 4.7, 4.0,
                3.6, 4.9, 4.8, 5.3, 5.6, 4.1, 3.7, 7.6, 6.9, 5.1, 6.4, 3.8,
                4.0, 8.6, 4.1, 1.4, 8.9, 3.0, 1.6, 8.5, 4.7, 6.6, 8.1, 4.5,
                4.8, 11.3, 4.7, 5.2, 11.5, 6.2, 2.9, 4.3, 2.8, 2.8, 6.3, 2.6,
                -0.0, 7.3, 3.4, 4.7, 9.3, 6.4, 5.4, 7.6, 5.2]

In [2]:
cold = []
slippery = []
comfortable = []
warm = []
for temperature in temperatures:
    if temperature < -2:
        cold.append(temperature)
    elif temperature >= 2:
        warm.append(temperature)
    if (temperature >= -2) and (temperature < 2):
        slippery.append(temperature)
    if (temperature >= 2) and (temperature < 15):
        comfortable.append(temperature)

In [3]:
amt_cold = len(cold)
print('It was cold', amt_cold, 'times in Helsinki.')

It was cold 15 times in Helsinki.

In [4]:
amt_comfort = len(comfortable)
print('It was comfortable', amt_comfort, 'times in Helsinki.')

It was comfortable 59 times in Helsinki.

In [5]:
amt_warm = len(warm)
print('It was warm', amt_warm, 'times in Helsinki.')

It was warm 59 times in Helsinki.

# Solution for Exercise 2.6

In [6]:
def farh_to_celsius(temp_farh):
    """Converts Fahrenheit to Celsius"""
    temp_celsius = (temp_farh - 32) * 5/9
    return temp_celsius

In [7]:
farh_to_celsius(temp_farh=32)

0.0

In [8]:
farh_to_celsius(temp_farh=68)

20.0

In [9]:
farh_to_celsius(temp_farh=91)

32.77777777777778

In [10]:
farh_to_celsius(temp_farh=-17)

-27.22222222222222

# Solution for Exercise 2.7

In [11]:
def class_temp(temp_celsius):
    if temp_celsius < -2:
        return 0
    elif temp_celsius >= -2 and temp_celsius < 2:
        return 1
    elif temp_celsius >= 2 and temp_celsius < 15:
        return 2
    else:
        return 3

In [12]:
class_temp(temp_celsius=17)

3

In [13]:
class_temp(temp_celsius=2)

2

In [14]:
class_temp(temp_celsius=1.9)

1

In [15]:
class_temp(temp_celsius=-2)

1

# Solution for Exercise 3.1

## Problem 1

In [132]:
import pandas as pd

In [145]:
data = pd.read_csv("data/6153237444115dat.csv")

In [146]:
data.head()

,USAF,WBAN,YR--MODAHRMN,DIR,SPD,GUS,CLG,SKC,L,M,...,SLP,ALT,STP,MAX,MIN,PCP01,PCP06,PCP24,PCPXX,SD
0,28450,99999,201705010000,174,10,14,***,***,*,*,...,1009.2,*****,984.1,***,***,*****,*****,*****,*****,35
1,28450,99999,201705010020,180,10,***,4,***,*,*,...,******,29.74,******,***,***,*****,*****,*****,*****,**
2,28450,99999,201705010050,190,10,***,4,***,*,*,...,******,29.74,******,***,***,*****,*****,*****,*****,**
3,28450,99999,201705010100,188,12,16,***,***,*,*,...,1009.1,*****,984.0,***,***,*****,*****,*****,*****,35
4,28450,99999,201705010120,200,13,***,2,OBS,*,*,...,******,29.74,******,***,***,*****,*****,*****,*****,**

## Problem 2

In [147]:
data.shape
# 11694 rows

(11694, 33)

In [148]:
data.columns

Index(['USAF', 'WBAN', 'YR--MODAHRMN', 'DIR', 'SPD', 'GUS', 'CLG', 'SKC', 'L',
       'M', 'H', 'VSB', 'MW', 'MW.1', 'MW.2', 'MW.3', 'AW', 'AW.1', 'AW.2',
       'AW.3', 'W', 'TEMP', 'DEWP', 'SLP', 'ALT', 'STP', 'MAX', 'MIN', 'PCP01',
       'PCP06', 'PCP24', 'PCPXX', 'SD'],
      dtype='object')

In [149]:
data.dtypes

USAF             int64
WBAN             int64
YR--MODAHRMN     int64
DIR             object
SPD             object
GUS             object
CLG             object
SKC             object
L               object
M               object
H               object
VSB             object
MW              object
MW.1            object
MW.2            object
MW.3            object
AW              object
AW.1            object
AW.2            object
AW.3            object
W               object
TEMP            object
DEWP            object
SLP             object
ALT             object
STP             object
MAX             object
MIN             object
PCP01           object
PCP06           object
PCP24           object
PCPXX           object
SD              object
dtype: object

## Problem 3

In [150]:
data['TEMP'] = pd.to_numeric(data['TEMP'], errors = 'coerce')

In [151]:
data['TEMP'].mean()
print("TEMP Mean:", data['TEMP'].mean())

TEMP Mean: 52.24796852279531

In [152]:
data['MAX'] = pd.to_numeric(data['MAX'], errors = 'coerce')
data['MIN'] = pd.to_numeric(data['MIN'], errors = 'coerce')

In [153]:
data['MAX'].std()
print("MAX TEMP Standard Deviation:", data['MAX'].std())

MAX TEMP Standard Deviation: 10.307989094641968

In [154]:
data['USAF'] = pd.to_numeric(data['USAF'], errors = 'coerce')

In [155]:
data['USAF'].nunique()
print("Number of Unique Stations:", data['USAF'].nunique())

Number of Unique Stations: 2

In [156]:
data['USAF'].head()

0    28450
1    28450
2    28450
3    28450
4    28450
Name: USAF, dtype: int64

# Solution for Exercise 3.2

## Problem 1

In [239]:
selected = data[['USAF', 'YR--MODAHRMN', 'TEMP', 'MAX', 'MIN']]
selected

        USAF  YR--MODAHRMN  TEMP  MAX  MIN
0      28450  201705010000  31.0  NaN  NaN
1      28450  201705010020  30.0  NaN  NaN
2      28450  201705010050  30.0  NaN  NaN
3      28450  201705010100  31.0  NaN  NaN
4      28450  201705010120  30.0  NaN  NaN
...      ...           ...   ...  ...  ...
11689  29980  201708311900  64.0  NaN  NaN
11690  29980  201708312000  64.0  NaN  NaN
11691  29980  201708312100  64.0  NaN  NaN
11692  29980  201708312200  64.0  NaN  NaN
11693  29980  201708312300  64.0  NaN  NaN

[11694 rows x 5 columns]

In [240]:
temp = data.loc[0:11694, ["TEMP"]]

In [241]:
cols_to_check = ["TEMP"]
temp_clean = temp.dropna(subset = cols_to_check)
temp_clean

       TEMP
0      31.0
1      30.0
2      30.0
3      31.0
4      30.0
...     ...
11689  64.0
11690  64.0
11691  64.0
11692  64.0
11693  64.0

[11691 rows x 1 columns]

## Problem 2

In [242]:
data["CELSIUS"] = 0.0
data.head()

,USAF,WBAN,YR--MODAHRMN,DIR,SPD,GUS,CLG,SKC,L,M,...,ALT,STP,MAX,MIN,PCP01,PCP06,PCP24,PCPXX,SD,CELSIUS
0,28450,99999,201705010000,174,10,14,***,***,*,*,...,*****,984.1,NaN,NaN,*****,*****,*****,*****,35,0.0
1,28450,99999,201705010020,180,10,***,4,***,*,*,...,29.74,******,NaN,NaN,*****,*****,*****,*****,**,0.0
2,28450,99999,201705010050,190,10,***,4,***,*,*,...,29.74,******,NaN,NaN,*****,*****,*****,*****,**,0.0
3,28450,99999,201705010100,188,12,16,***,***,*,*,...,*****,984.0,NaN,NaN,*****,*****,*****,*****,35,0.0
4,28450,99999,201705010120,200,13,***,2,OBS,*,*,...,29.74,******,NaN,NaN,*****,*****,*****,*****,**,0.0

In [243]:
TempFahrenheit = selected['TEMP']
TempCelsius = (TempFahrenheit - 32) / 1.8
data["CELSIUS"] = TempCelsius

selected = data[['USAF', 'YR--MODAHRMN', 'TEMP', 'MAX', 'MIN', 'CELSIUS']]
selected

        USAF  YR--MODAHRMN  TEMP  MAX  MIN    CELSIUS
0      28450  201705010000  31.0  NaN  NaN  -0.555556
1      28450  201705010020  30.0  NaN  NaN  -1.111111
2      28450  201705010050  30.0  NaN  NaN  -1.111111
3      28450  201705010100  31.0  NaN  NaN  -0.555556
4      28450  201705010120  30.0  NaN  NaN  -1.111111
...      ...           ...   ...  ...  ...        ...
11689  29980  201708311900  64.0  NaN  NaN  17.777778
11690  29980  201708312000  64.0  NaN  NaN  17.777778
11691  29980  201708312100  64.0  NaN  NaN  17.777778
11692  29980  201708312200  64.0  NaN  NaN  17.777778
11693  29980  201708312300  64.0  NaN  NaN  17.777778

[11694 rows x 6 columns]

## Problem 3

In [244]:
#data = pd.read_csv("data/6153237444115dat.csv")

In [245]:
data.head()

,USAF,WBAN,YR--MODAHRMN,DIR,SPD,GUS,CLG,SKC,L,M,...,ALT,STP,MAX,MIN,PCP01,PCP06,PCP24,PCPXX,SD,CELSIUS
0,28450,99999,201705010000,174,10,14,***,***,*,*,...,*****,984.1,NaN,NaN,*****,*****,*****,*****,35,-0.555556
1,28450,99999,201705010020,180,10,***,4,***,*,*,...,29.74,******,NaN,NaN,*****,*****,*****,*****,**,-1.111111
2,28450,99999,201705010050,190,10,***,4,***,*,*,...,29.74,******,NaN,NaN,*****,*****,*****,*****,**,-1.111111
3,28450,99999,201705010100,188,12,16,***,***,*,*,...,*****,984.0,NaN,NaN,*****,*****,*****,*****,35,-0.555556
4,28450,99999,201705010120,200,13,***,2,OBS,*,*,...,29.74,******,NaN,NaN,*****,*****,*****,*****,**,-1.111111

In [246]:
selected = data[['USAF', 'YR--MODAHRMN', 'TEMP', 'MAX', 'MIN', 'CELSIUS']]
selected

        USAF  YR--MODAHRMN  TEMP  MAX  MIN    CELSIUS
0      28450  201705010000  31.0  NaN  NaN  -0.555556
1      28450  201705010020  30.0  NaN  NaN  -1.111111
2      28450  201705010050  30.0  NaN  NaN  -1.111111
3      28450  201705010100  31.0  NaN  NaN  -0.555556
4      28450  201705010120  30.0  NaN  NaN  -1.111111
...      ...           ...   ...  ...  ...        ...
11689  29980  201708311900  64.0  NaN  NaN  17.777778
11690  29980  201708312000  64.0  NaN  NaN  17.777778
11691  29980  201708312100  64.0  NaN  NaN  17.777778
11692  29980  201708312200  64.0  NaN  NaN  17.777778
11693  29980  201708312300  64.0  NaN  NaN  17.777778

[11694 rows x 6 columns]

In [247]:
selection_USAF1 = [29980]
kumpula = selected.loc[selected["USAF"].isin(selection_USAF1)]
kumpula

        USAF  YR--MODAHRMN  TEMP  MAX  MIN    CELSIUS
8770   29980  201705010000  37.0  NaN  NaN   2.777778
8771   29980  201705010100  37.0  NaN  NaN   2.777778
8772   29980  201705010200  37.0  NaN  NaN   2.777778
8773   29980  201705010300  37.0  NaN  NaN   2.777778
8774   29980  201705010400  39.0  NaN  NaN   3.888889
...      ...           ...   ...  ...  ...        ...
11689  29980  201708311900  64.0  NaN  NaN  17.777778
11690  29980  201708312000  64.0  NaN  NaN  17.777778
11691  29980  201708312100  64.0  NaN  NaN  17.777778
11692  29980  201708312200  64.0  NaN  NaN  17.777778
11693  29980  201708312300  64.0  NaN  NaN  17.777778

[2924 rows x 6 columns]

In [248]:
kumpula.to_csv("Kumpula_temps_May_Aug_2017.csv", sep=',', float_format='%.2f')

In [249]:
selection_USAF2 = [28450]
rovaniemi = selected.loc[selected["USAF"].isin(selection_USAF2)]
rovaniemi

       USAF  YR--MODAHRMN  TEMP  MAX  MIN   CELSIUS
0     28450  201705010000  31.0  NaN  NaN -0.555556
1     28450  201705010020  30.0  NaN  NaN -1.111111
2     28450  201705010050  30.0  NaN  NaN -1.111111
3     28450  201705010100  31.0  NaN  NaN -0.555556
4     28450  201705010120  30.0  NaN  NaN -1.111111
...     ...           ...   ...  ...  ...       ...
8765  28450  201708312220  46.0  NaN  NaN  7.777778
8766  28450  201708312250  46.0  NaN  NaN  7.777778
8767  28450  201708312300  48.0  NaN  NaN  8.888889
8768  28450  201708312320  46.0  NaN  NaN  7.777778
8769  28450  201708312350  48.0  NaN  NaN  8.888889

[8770 rows x 6 columns]

In [250]:
rovaniemi.to_csv("Rovaniemi_temps_May_Aug_2017.csv", sep=',', float_format='%.2f')

# Exercise 3.3

## Problem 1

In [251]:
#Reading the CSV files
kumpula = pd.read_csv("Kumpula_temps_May_Aug_2017.csv")
rovaniemi = pd.read_csv("Rovaniemi_temps_May_Aug_2017.csv")

In [252]:
rovaniemi.head()

   Unnamed: 0   USAF  YR--MODAHRMN  TEMP  MAX  MIN  CELSIUS
0           0  28450  201705010000  31.0  NaN  NaN    -0.56
1           1  28450  201705010020  30.0  NaN  NaN    -1.11
2           2  28450  201705010050  30.0  NaN  NaN    -1.11
3           3  28450  201705010100  31.0  NaN  NaN    -0.56
4           4  28450  201705010120  30.0  NaN  NaN    -1.11

In [253]:
kumpula.head()

   Unnamed: 0   USAF  YR--MODAHRMN  TEMP  MAX  MIN  CELSIUS
0        8770  29980  201705010000  37.0  NaN  NaN     2.78
1        8771  29980  201705010100  37.0  NaN  NaN     2.78
2        8772  29980  201705010200  37.0  NaN  NaN     2.78
3        8773  29980  201705010300  37.0  NaN  NaN     2.78
4        8774  29980  201705010400  39.0  NaN  NaN     3.89

In [254]:
#Cleaning the data file
rovaniemi = pd.read_csv(
     "Rovaniemi_temps_May_Aug_2017.csv",
     na_values=["*", "**", "***", "****", "*****", "******"])

In [255]:
rovaniemi.head()

   Unnamed: 0   USAF  YR--MODAHRMN  TEMP  MAX  MIN  CELSIUS
0           0  28450  201705010000  31.0  NaN  NaN    -0.56
1           1  28450  201705010020  30.0  NaN  NaN    -1.11
2           2  28450  201705010050  30.0  NaN  NaN    -1.11
3           3  28450  201705010100  31.0  NaN  NaN    -0.56
4           4  28450  201705010120  30.0  NaN  NaN    -1.11

In [256]:
#Checking data types for TEMP column in the data
kumpula.dtypes

Unnamed: 0        int64
USAF              int64
YR--MODAHRMN      int64
TEMP            float64
MAX             float64
MIN             float64
CELSIUS         float64
dtype: object

In [257]:
#Checking the header names to ensure I call the right column
kumpula.head()

   Unnamed: 0   USAF  YR--MODAHRMN  TEMP  MAX  MIN  CELSIUS
0        8770  29980  201705010000  37.0  NaN  NaN     2.78
1        8771  29980  201705010100  37.0  NaN  NaN     2.78
2        8772  29980  201705010200  37.0  NaN  NaN     2.78
3        8773  29980  201705010300  37.0  NaN  NaN     2.78
4        8774  29980  201705010400  39.0  NaN  NaN     3.89

In [258]:
#Finding mean of the TEMP column for one data set
kumpula_median = kumpula["TEMP"].median()
kumpula_median

58.0

In [259]:
rovaniemi_median = rovaniemi['TEMP'].median()
rovaniemi_median

52.0

## Problem 2

In [260]:
#Checking data for Year, Month, Day column
kumpula["YR--MODAHRMN"].head()

0    201705010000
1    201705010100
2    201705010200
3    201705010300
4    201705010400
Name: YR--MODAHRMN, dtype: int64

In [261]:
#Checking data for Year, Month, Day column
rovaniemi["YR--MODAHRMN"].head()

0    201705010000
1    201705010020
2    201705010050
3    201705010100
4    201705010120
Name: YR--MODAHRMN, dtype: int64

In [262]:
#Converting column information to a string
kumpula["TIME_STR"] = kumpula["YR--MODAHRMN"].astype(str)
rovaniemi["TIME_STR"] = rovaniemi["YR--MODAHRMN"].astype(str)

In [263]:
#Finding last date
kumpula["YR--MODAHRMN"].tail()

2919    201708311900
2920    201708312000
2921    201708312100
2922    201708312200
2923    201708312300
Name: YR--MODAHRMN, dtype: int64

In [264]:
rovaniemi["YR--MODAHRMN"].tail()

8765    201708312220
8766    201708312250
8767    201708312300
8768    201708312320
8769    201708312350
Name: YR--MODAHRMN, dtype: int64

In [265]:
#Slicing the string to only have month and year
date = "201705010000"
date[0:6]

'201705'

In [266]:
#Adding the Year and Month Column to the data frame
kumpula["YEAR_MONTH"] = kumpula["TIME_STR"].str.slice(start=0, stop=6)
kumpula.head()

,Unnamed: 0,USAF,YR--MODAHRMN,TEMP,MAX,MIN,CELSIUS,TIME_STR,YEAR_MONTH
0,8770,29980,201705010000,37.0,NaN,NaN,2.78,201705010000,201705
1,8771,29980,201705010100,37.0,NaN,NaN,2.78,201705010100,201705
2,8772,29980,201705010200,37.0,NaN,NaN,2.78,201705010200,201705
3,8773,29980,201705010300,37.0,NaN,NaN,2.78,201705010300,201705
4,8774,29980,201705010400,39.0,NaN,NaN,3.89,201705010400,201705

In [267]:
#Adding the Year and Month Column to the data frame
rovaniemi["YEAR_MONTH"] = rovaniemi["TIME_STR"].str.slice(start=0, stop=6)
rovaniemi.head()

,Unnamed: 0,USAF,YR--MODAHRMN,TEMP,MAX,MIN,CELSIUS,TIME_STR,YEAR_MONTH
0,0,28450,201705010000,31.0,NaN,NaN,-0.56,201705010000,201705
1,1,28450,201705010020,30.0,NaN,NaN,-1.11,201705010020,201705
2,2,28450,201705010050,30.0,NaN,NaN,-1.11,201705010050,201705
3,3,28450,201705010100,31.0,NaN,NaN,-0.56,201705010100,201705
4,4,28450,201705010120,30.0,NaN,NaN,-1.11,201705010120,201705

In [268]:
#Checking data types
kumpula.dtypes

Unnamed: 0        int64
USAF              int64
YR--MODAHRMN      int64
TEMP            float64
MAX             float64
MIN             float64
CELSIUS         float64
TIME_STR         object
YEAR_MONTH       object
dtype: object

In [269]:
#Checking data types
rovaniemi.dtypes

Unnamed: 0        int64
USAF              int64
YR--MODAHRMN      int64
TEMP            float64
MAX             float64
MIN             float64
CELSIUS         float64
TIME_STR         object
YEAR_MONTH       object
dtype: object

In [270]:
#Converting YEAR_MONTH to integer
kumpula['YEAR_MONTH'] = pd.to_numeric(kumpula['YEAR_MONTH'], errors = 'coerce')
rovaniemi['YEAR_MONTH'] = pd.to_numeric(rovaniemi['YEAR_MONTH'], errors = 'coerce')

In [271]:
#Check to see if conversion worked
kumpula.dtypes

Unnamed: 0        int64
USAF              int64
YR--MODAHRMN      int64
TEMP            float64
MAX             float64
MIN             float64
CELSIUS         float64
TIME_STR         object
YEAR_MONTH        int64
dtype: object

In [272]:
#Check to see if conversion worked
rovaniemi.dtypes

Unnamed: 0        int64
USAF              int64
YR--MODAHRMN      int64
TEMP            float64
MAX             float64
MIN             float64
CELSIUS         float64
TIME_STR         object
YEAR_MONTH        int64
dtype: object

In [273]:
#List of value that will be used for selecting the rows
selection_criteria = [201705]

#Do the selection based on criteria applied to selected column
kumpula_may = kumpula.loc[kumpula["YEAR_MONTH"].isin(selection_criteria)]
kumpula_may

,Unnamed: 0,USAF,YR--MODAHRMN,TEMP,MAX,MIN,CELSIUS,TIME_STR,YEAR_MONTH
0,8770,29980,201705010000,37.0,NaN,NaN,2.78,201705010000,201705
1,8771,29980,201705010100,37.0,NaN,NaN,2.78,201705010100,201705
2,8772,29980,201705010200,37.0,NaN,NaN,2.78,201705010200,201705
3,8773,29980,201705010300,37.0,NaN,NaN,2.78,201705010300,201705
4,8774,29980,201705010400,39.0,NaN,NaN,3.89,201705010400,201705
...,...,...,...,...,...,...,...,...,...
736,9506,29980,201705311900,51.0,NaN,NaN,10.56,201705311900,201705
737,9507,29980,201705312000,50.0,NaN,NaN,10.00,201705312000,201705
738,9508,29980,201705312100,47.0,NaN,NaN,8.33,201705312100,201705
739,9509,29980,201705312200,44.0,NaN,NaN,6.67,201705312200,201705
740,9510,29980,201705312300,43.0,NaN,NaN,6.11,201705312300,201705

In [274]:
#Do the selection based on criteria applied to selected column
rovaniemi_may = rovaniemi.loc[rovaniemi["YEAR_MONTH"].isin(selection_criteria)]
rovaniemi_may

,Unnamed: 0,USAF,YR--MODAHRMN,TEMP,MAX,MIN,CELSIUS,TIME_STR,YEAR_MONTH
0,0,28450,201705010000,31.0,NaN,NaN,-0.56,201705010000,201705
1,1,28450,201705010020,30.0,NaN,NaN,-1.11,201705010020,201705
2,2,28450,201705010050,30.0,NaN,NaN,-1.11,201705010050,201705
3,3,28450,201705010100,31.0,NaN,NaN,-0.56,201705010100,201705
4,4,28450,201705010120,30.0,NaN,NaN,-1.11,201705010120,201705
...,...,...,...,...,...,...,...,...,...
2217,2217,28450,201705312220,32.0,NaN,NaN,0.00,201705312220,201705
2218,2218,28450,201705312250,32.0,NaN,NaN,0.00,201705312250,201705
2219,2219,28450,201705312300,33.0,NaN,NaN,0.56,201705312300,201705
2220,2220,28450,201705312320,32.0,NaN,NaN,0.00,201705312320,201705
2221,2221,28450,201705312350,30.0,NaN,NaN,-1.11,201705312350,201705

In [275]:
#List of value that will be used for selecting the rows
selection_criteria2 = [201706]

#Do the selection based on criteria applied to selected column
kumpula_june = kumpula.loc[kumpula["YEAR_MONTH"].isin(selection_criteria2)]
kumpula_june

,Unnamed: 0,USAF,YR--MODAHRMN,TEMP,MAX,MIN,CELSIUS,TIME_STR,YEAR_MONTH
741,9511,29980,201706010000,42.0,NaN,NaN,5.56,201706010000,201706
742,9512,29980,201706010100,40.0,NaN,NaN,4.44,201706010100,201706
743,9513,29980,201706010200,40.0,NaN,NaN,4.44,201706010200,201706
744,9514,29980,201706010300,41.0,NaN,NaN,5.00,201706010300,201706
745,9515,29980,201706010400,44.0,NaN,NaN,6.67,201706010400,201706
...,...,...,...,...,...,...,...,...,...
1450,10220,29980,201706301900,65.0,NaN,NaN,18.33,201706301900,201706
1451,10221,29980,201706302000,61.0,NaN,NaN,16.11,201706302000,201706
1452,10222,29980,201706302100,63.0,NaN,NaN,17.22,201706302100,201706
1453,10223,29980,201706302200,62.0,NaN,NaN,16.67,201706302200,201706
1454,10224,29980,201706302300,61.0,NaN,NaN,16.11,201706302300,201706

In [276]:
#Do the selection based on criteria applied to selected column
rovaniemi_june = rovaniemi.loc[rovaniemi["YEAR_MONTH"].isin(selection_criteria2)]
rovaniemi_june

,Unnamed: 0,USAF,YR--MODAHRMN,TEMP,MAX,MIN,CELSIUS,TIME_STR,YEAR_MONTH
2222,2222,28450,201706010000,32.0,NaN,NaN,0.00,201706010000,201706
2223,2223,28450,201706010020,30.0,NaN,NaN,-1.11,201706010020,201706
2224,2224,28450,201706010050,30.0,NaN,NaN,-1.11,201706010050,201706
2225,2225,28450,201706010100,31.0,NaN,NaN,-0.56,201706010100,201706
2226,2226,28450,201706010120,30.0,NaN,NaN,-1.11,201706010120,201706
...,...,...,...,...,...,...,...,...,...
4344,4344,28450,201706302220,57.0,NaN,NaN,13.89,201706302220,201706
4345,4345,28450,201706302250,57.0,NaN,NaN,13.89,201706302250,201706
4346,4346,28450,201706302300,56.0,NaN,NaN,13.33,201706302300,201706
4347,4347,28450,201706302320,57.0,NaN,NaN,13.89,201706302320,201706
4348,4348,28450,201706302350,57.0,NaN,NaN,13.89,201706302350,201706

In [277]:
#Gathering and printing data from selected data
kumpula_may['CELSIUS'].mean()
kumpula_may['CELSIUS'].max()
kumpula_may['CELSIUS'].min()
print('Kumpula May Mean:', kumpula_may['CELSIUS'].mean(), 'CELSIUS')
print('Kumpula May Max:', kumpula_may['CELSIUS'].max(), 'CELSIUS')
print('Kumpula May Min:', kumpula_may['CELSIUS'].min(), 'CELSIUS')

Kumpula May Mean: 9.757840755735492 CELSIUS
Kumpula May Max: 22.78 CELSIUS
Kumpula May Min: -2.22 CELSIUS

In [278]:
kumpula_june['CELSIUS'].mean()
kumpula_june['CELSIUS'].max()
kumpula_june['CELSIUS'].min()
print('Kumpula June Mean:', kumpula_june['CELSIUS'].mean(), 'CELSIUS')
print('Kumpula June Max:', kumpula_june['CELSIUS'].max(), 'CELSIUS')
print('Kumpula June Min:', kumpula_june['CELSIUS'].min(), 'CELSIUS')

Kumpula June Mean: 13.741736694677872 CELSIUS
Kumpula June Max: 23.89 CELSIUS
Kumpula June Min: 2.78 CELSIUS

In [279]:
rovaniemi_may['CELSIUS'].mean()
rovaniemi_may['CELSIUS'].max()
rovaniemi_may['CELSIUS'].min()
print('Rovaniemi May Mean:', rovaniemi_may['CELSIUS'].mean(), 'CELSIUS')
print('Rovaniemi May Max:', rovaniemi_may['CELSIUS'].max(), 'CELSIUS')
print('Rovaniemi May Min:', rovaniemi_may['CELSIUS'].min(), 'CELSIUS')

Rovaniemi May Mean: 2.991684684684685 CELSIUS
Rovaniemi May Max: 15.0 CELSIUS
Rovaniemi May Min: -7.22 CELSIUS

In [280]:
rovaniemi_june['CELSIUS'].mean()
rovaniemi_june['CELSIUS'].max()
rovaniemi_june['CELSIUS'].min()
print('Rovaniemi May Mean:', rovaniemi_june['CELSIUS'].mean(), 'CELSIUS')
print('Rovaniemi May Max:', rovaniemi_june['CELSIUS'].max(), 'CELSIUS')
print('Rovaniemi May Min:', rovaniemi_june['CELSIUS'].min(), 'CELSIUS')

Rovaniemi May Mean: 11.019412317818524 CELSIUS
Rovaniemi May Max: 23.33 CELSIUS
Rovaniemi May Min: -1.11 CELSIUS

There seems to be a small difference between the temperatures in May and June for Kumpula on the mean and max temperatures. However, the minimum temperatures do have a significant difference between months though. For Rovaniemi, the temperatures between months are largely different in the Mean, Max, and Min. 

Looking at the outputs, Rovaniemi is much colder than Kumpula in May and June.

## Problem 3

In [333]:
#Read kumpula original file and confirm dates are turned into strings
kumpula = pd.read_csv("Kumpula_temps_May_Aug_2017.csv")
kumpula["TIME_STR"] = kumpula["YR--MODAHRMN"].astype(str)

In [334]:
#Check data
kumpula.head()

   Unnamed: 0   USAF  YR--MODAHRMN  TEMP  MAX  MIN  CELSIUS      TIME_STR
0        8770  29980  201705010000  37.0  NaN  NaN     2.78  201705010000
1        8771  29980  201705010100  37.0  NaN  NaN     2.78  201705010100
2        8772  29980  201705010200  37.0  NaN  NaN     2.78  201705010200
3        8773  29980  201705010300  37.0  NaN  NaN     2.78  201705010300
4        8774  29980  201705010400  39.0  NaN  NaN     3.89  201705010400

In [343]:
#Removing Columns that aren't needed
selected_kumpula = kumpula[['USAF', 'YR--MODAHRMN', 'TEMP', 'MAX', 'MIN', 'CELSIUS', 'TIME_STR']]
selected_kumpula

       USAF  YR--MODAHRMN  TEMP  MAX  MIN  CELSIUS      TIME_STR
0     29980  201705010000  37.0  NaN  NaN     2.78  201705010000
1     29980  201705010100  37.0  NaN  NaN     2.78  201705010100
2     29980  201705010200  37.0  NaN  NaN     2.78  201705010200
3     29980  201705010300  37.0  NaN  NaN     2.78  201705010300
4     29980  201705010400  39.0  NaN  NaN     3.89  201705010400
...     ...           ...   ...  ...  ...      ...           ...
2919  29980  201708311900  64.0  NaN  NaN    17.78  201708311900
2920  29980  201708312000  64.0  NaN  NaN    17.78  201708312000
2921  29980  201708312100  64.0  NaN  NaN    17.78  201708312100
2922  29980  201708312200  64.0  NaN  NaN    17.78  201708312200
2923  29980  201708312300  64.0  NaN  NaN    17.78  201708312300

[2924 rows x 7 columns]

In [344]:
rovaniemi.head()

,Unnamed: 0,USAF,YR--MODAHRMN,TEMP,MAX,MIN,CELSIUS,TIME_STR,YEAR_MONTH,YEAR_MONTH_DAY
0,0,28450,201705010000,31.0,NaN,NaN,-0.56,201705010000,201705,20170501
1,1,28450,201705010020,30.0,NaN,NaN,-1.11,201705010020,201705,20170501
2,2,28450,201705010050,30.0,NaN,NaN,-1.11,201705010050,201705,20170501
3,3,28450,201705010100,31.0,NaN,NaN,-0.56,201705010100,201705,20170501
4,4,28450,201705010120,30.0,NaN,NaN,-1.11,201705010120,201705,20170501

In [345]:
#Removing Columns that aren't needed
selected_rovaniemi = rovaniemi[['USAF', 'YR--MODAHRMN', 'TEMP', 'MAX', 'MIN', 'CELSIUS', 'TIME_STR']]
selected_rovaniemi

       USAF  YR--MODAHRMN  TEMP  MAX  MIN  CELSIUS      TIME_STR
0     28450  201705010000  31.0  NaN  NaN    -0.56  201705010000
1     28450  201705010020  30.0  NaN  NaN    -1.11  201705010020
2     28450  201705010050  30.0  NaN  NaN    -1.11  201705010050
3     28450  201705010100  31.0  NaN  NaN    -0.56  201705010100
4     28450  201705010120  30.0  NaN  NaN    -1.11  201705010120
...     ...           ...   ...  ...  ...      ...           ...
8765  28450  201708312220  46.0  NaN  NaN     7.78  201708312220
8766  28450  201708312250  46.0  NaN  NaN     7.78  201708312250
8767  28450  201708312300  48.0  NaN  NaN     8.89  201708312300
8768  28450  201708312320  46.0  NaN  NaN     7.78  201708312320
8769  28450  201708312350  48.0  NaN  NaN     8.89  201708312350

[8770 rows x 7 columns]

In [352]:
#Slicing our time strings to only be Month & Day from our selected data columns
kumpula["DAY"] = selected_kumpula["TIME_STR"].str.slice(start = 4, stop = 8)
kumpula["DAY"].head()

0    0501
1    0501
2    0501
3    0501
4    0501
Name: DAY, dtype: object

In [353]:
rovaniemi["DAY"] = selected_rovaniemi["TIME_STR"].str.slice(start = 4, stop = 8)
rovaniemi["DAY"].head()

0    0501
1    0501
2    0501
3    0501
4    0501
Name: DAY, dtype: object

In [358]:
#Grouping data by dates
grouped_kumpula = kumpula.groupby("DAY")
days_kumpula = list(grouped_kumpula.groups.keys())
days_kumpula

['0501',
 '0502',
 '0503',
 '0504',
 '0505',
 '0506',
 '0507',
 '0508',
 '0509',
 '0510',
 '0511',
 '0512',
 '0513',
 '0514',
 '0515',
 '0516',
 '0517',
 '0518',
 '0519',
 '0520',
 '0521',
 '0522',
 '0523',
 '0524',
 '0525',
 '0526',
 '0527',
 '0528',
 '0529',
 '0530',
 '0531',
 '0601',
 '0602',
 '0603',
 '0604',
 '0605',
 '0606',
 '0607',
 '0608',
 '0609',
 '0610',
 '0611',
 '0612',
 '0613',
 '0614',
 '0615',
 '0616',
 '0617',
 '0618',
 '0619',
 '0620',
 '0621',
 '0622',
 '0623',
 '0624',
 '0625',
 '0626',
 '0627',
 '0628',
 '0629',
 '0630',
 '0701',
 '0702',
 '0703',
 '0704',
 '0705',
 '0706',
 '0707',
 '0708',
 '0709',
 '0710',
 '0711',
 '0712',
 '0713',
 '0714',
 '0715',
 '0716',
 '0717',
 '0718',
 '0719',
 '0720',
 '0721',
 '0722',
 '0723',
 '0724',
 '0725',
 '0726',
 '0727',
 '0728',
 '0729',
 '0730',
 '0731',
 '0801',
 '0802',
 '0803',
 '0804',
 '0805',
 '0806',
 '0807',
 '0808',
 '0809',
 '0810',
 '0811',
 '0812',
 '0813',
 '0814',
 '0815',
 '0816',
 '0817',
 '0818',
 '0819',
 '0820',
 '0821',
 '0822',
 '0823',
 '0824',
 '0825',
 '0826',
 '0827',
 '0828',
 '0829',
 '0830',
 '0831']

In [359]:
grouped_rovaniemi = rovaniemi.groupby("DAY")
days_rovaniemi = list(grouped_rovaniemi.groups.keys())
days_rovaniemi

['0501',
 '0502',
 '0503',
 '0504',
 '0505',
 '0506',
 '0507',
 '0508',
 '0509',
 '0510',
 '0511',
 '0512',
 '0513',
 '0514',
 '0515',
 '0516',
 '0517',
 '0518',
 '0519',
 '0520',
 '0521',
 '0522',
 '0523',
 '0524',
 '0525',
 '0526',
 '0527',
 '0528',
 '0529',
 '0530',
 '0531',
 '0601',
 '0602',
 '0603',
 '0604',
 '0605',
 '0606',
 '0607',
 '0608',
 '0609',
 '0610',
 '0611',
 '0612',
 '0613',
 '0614',
 '0615',
 '0616',
 '0617',
 '0618',
 '0619',
 '0620',
 '0621',
 '0622',
 '0623',
 '0624',
 '0625',
 '0626',
 '0627',
 '0628',
 '0629',
 '0630',
 '0701',
 '0702',
 '0703',
 '0704',
 '0705',
 '0706',
 '0707',
 '0708',
 '0709',
 '0710',
 '0711',
 '0712',
 '0713',
 '0714',
 '0715',
 '0716',
 '0717',
 '0718',
 '0719',
 '0720',
 '0721',
 '0722',
 '0723',
 '0724',
 '0725',
 '0726',
 '0727',
 '0728',
 '0729',
 '0730',
 '0731',
 '0801',
 '0802',
 '0803',
 '0804',
 '0805',
 '0806',
 '0807',
 '0808',
 '0809',
 '0810',
 '0811',
 '0812',
 '0813',
 '0814',
 '0815',
 '0816',
 '0817',
 '0818',
 '0819',
 '0820',
 '0821',
 '0822',
 '0823',
 '0824',
 '0825',
 '0826',
 '0827',
 '0828',
 '0829',
 '0830',
 '0831']

In [362]:
#Gathering data for Kumpula's Temps
grouped_kumpula.get_group(days_kumpula[0])["CELSIUS"]

0      2.78
1      2.78
2      2.78
3      2.78
4      3.89
5      5.00
6      6.67
7      7.22
8      8.89
9     10.56
10    11.11
11    10.56
12    12.22
13     9.44
14    10.00
15    11.11
16    10.00
17    11.11
18     8.89
19     8.89
20     7.78
21     6.67
22     5.56
23     3.89
Name: CELSIUS, dtype: float64

In [364]:
#Gathering data for Rovaniemi's Temps
grouped_rovaniemi.get_group(days_rovaniemi[0])["CELSIUS"]

0    -0.56
1    -1.11
2    -1.11
3    -0.56
4    -1.11
      ...
67    2.78
68    2.22
69    2.22
70    2.22
71    2.22
Name: CELSIUS, Length: 72, dtype: float64

In [376]:
#Finding Max, Min, Mean temperature for Kumpula
for i in range(len(days_kumpula[0:31])):
    print("Month-Day:", str(days_kumpula[0:31][i]), "Max Temp:", str(grouped_kumpula.get_group(days_kumpula[0:31][i])["CELSIUS"].max()))
    print("Month-Day:", str(days_kumpula[0:31][i]), "Min Temp:", str(grouped_kumpula.get_group(days_kumpula[0:31][i])["CELSIUS"].min()))
    print("Month-Day:", str(days_kumpula[0:31][i]), "Mean Temp:", str(grouped_kumpula.get_group(days_kumpula[0:31][i])["CELSIUS"].mean()))

Month-Day: 0501 Max Temp: 12.22
Month-Day: 0501 Min Temp: 2.78
Month-Day: 0501 Mean Temp: 7.524166666666667
Month-Day: 0502 Max Temp: 15.56
Month-Day: 0502 Min Temp: 1.67
Month-Day: 0502 Mean Temp: 9.699583333333335
Month-Day: 0503 Max Temp: 13.33
Month-Day: 0503 Min Temp: 3.89
Month-Day: 0503 Mean Temp: 9.212916666666667
Month-Day: 0504 Max Temp: 10.56
Month-Day: 0504 Min Temp: 3.33
Month-Day: 0504 Mean Temp: 6.78125
Month-Day: 0505 Max Temp: 16.67
Month-Day: 0505 Min Temp: 1.67
Month-Day: 0505 Mean Temp: 10.323333333333332
Month-Day: 0506 Max Temp: 15.0
Month-Day: 0506 Min Temp: 6.11
Month-Day: 0506 Mean Temp: 11.086666666666666
Month-Day: 0507 Max Temp: 8.89
Month-Day: 0507 Min Temp: 2.22
Month-Day: 0507 Mean Temp: 5.8566666666666665
Month-Day: 0508 Max Temp: 7.22
Month-Day: 0508 Min Temp: 1.11
Month-Day: 0508 Mean Temp: 4.213333333333333
Month-Day: 0509 Max Temp: 3.89
Month-Day: 0509 Min Temp: -1.67
Month-Day: 0509 Mean Temp: 1.5520833333333333
Month-Day: 0510 Max Temp: 4.44
Month-Day: 0510 Min Temp: -1.67
Month-Day: 0510 Mean Temp: 1.5966666666666667
Month-Day: 0511 Max Temp: 7.78
Month-Day: 0511 Min Temp: -2.22
Month-Day: 0511 Mean Temp: 2.7770833333333336
Month-Day: 0512 Max Temp: 10.56
Month-Day: 0512 Min Temp: -1.67
Month-Day: 0512 Mean Temp: 5.322500000000001
Month-Day: 0513 Max Temp: 12.78
Month-Day: 0513 Min Temp: 0.56
Month-Day: 0513 Mean Temp: 7.615416666666666
Month-Day: 0514 Max Temp: 13.89
Month-Day: 0514 Min Temp: 3.33
Month-Day: 0514 Mean Temp: 10.00125
Month-Day: 0515 Max Temp: 13.89
Month-Day: 0515 Min Temp: 2.78
Month-Day: 0515 Mean Temp: 8.70375
Month-Day: 0516 Max Temp: 11.67
Month-Day: 0516 Min Temp: 0.56
Month-Day: 0516 Mean Temp: 7.126521739130434
Month-Day: 0517 Max Temp: 12.78
Month-Day: 0517 Min Temp: 5.56
Month-Day: 0517 Mean Temp: 9.653333333333332
Month-Day: 0518 Max Temp: 13.89
Month-Day: 0518 Min Temp: 8.89
Month-Day: 0518 Mean Temp: 10.972500000000002
Month-Day: 0519 Max Temp: 22.78
Month-Day: 0519 Min Temp: 9.44
Month-Day: 0519 Mean Temp: 16.434583333333332
Month-Day: 0520 Max Temp: 21.67
Month-Day: 0520 Min Temp: 12.78
Month-Day: 0520 Mean Temp: 16.85291666666667
Month-Day: 0521 Max Temp: 18.33
Month-Day: 0521 Min Temp: 10.56
Month-Day: 0521 Mean Temp: 14.792083333333332
Month-Day: 0522 Max Temp: 18.89
Month-Day: 0522 Min Temp: 9.44
Month-Day: 0522 Mean Temp: 14.721666666666666
Month-Day: 0523 Max Temp: 18.33
Month-Day: 0523 Min Temp: 8.33
Month-Day: 0523 Mean Temp: 13.357083333333334
Month-Day: 0524 Max Temp: 16.67
Month-Day: 0524 Min Temp: 8.89
Month-Day: 0524 Mean Temp: 12.3375
Month-Day: 0525 Max Temp: 20.0
Month-Day: 0525 Min Temp: 8.89
Month-Day: 0525 Mean Temp: 14.027916666666668
Month-Day: 0526 Max Temp: 17.78
Month-Day: 0526 Min Temp: 7.78
Month-Day: 0526 Mean Temp: 13.77375
Month-Day: 0527 Max Temp: 12.22
Month-Day: 0527 Min Temp: 6.67
Month-Day: 0527 Mean Temp: 9.512916666666667
Month-Day: 0528 Max Temp: 17.78
Month-Day: 0528 Min Temp: 8.33
Month-Day: 0528 Mean Temp: 13.03125
Month-Day: 0529 Max Temp: 17.78
Month-Day: 0529 Min Temp: 6.11
Month-Day: 0529 Mean Temp: 13.561363636363637
Month-Day: 0530 Max Temp: 12.78
Month-Day: 0530 Min Temp: 4.44
Month-Day: 0530 Mean Temp: 9.699166666666667
Month-Day: 0531 Max Temp: 15.56
Month-Day: 0531 Min Temp: 6.11
Month-Day: 0531 Mean Temp: 10.579166666666667

In [377]:
#Finding Max, Min, Mean temperature for Rovaniemi
for i in range(len(days_rovaniemi[0:31])):
    print("Month-Day:", str(days_rovaniemi[0:31][i]), "Max Temp:", str(grouped_rovaniemi.get_group(days_rovaniemi[0:31][i])["CELSIUS"].max()))
    print("Month-Day:", str(days_rovaniemi[0:31][i]), "Min Temp:", str(grouped_rovaniemi.get_group(days_rovaniemi[0:31][i])["CELSIUS"].min()))
    print("Month-Day:", str(days_rovaniemi[0:31][i]), "Mean Temp:", str(grouped_rovaniemi.get_group(days_rovaniemi[0:31][i])["CELSIUS"].mean()))

Month-Day: 0501 Max Temp: 6.67
Month-Day: 0501 Min Temp: -1.11
Month-Day: 0501 Mean Temp: 2.198888888888889
Month-Day: 0502 Max Temp: 7.22
Month-Day: 0502 Min Temp: 0.56
Month-Day: 0502 Mean Temp: 3.433333333333333
Month-Day: 0503 Max Temp: 3.89
Month-Day: 0503 Min Temp: -1.11
Month-Day: 0503 Mean Temp: 2.1049295774647883
Month-Day: 0504 Max Temp: 8.89
Month-Day: 0504 Min Temp: -1.11
Month-Day: 0504 Mean Temp: 4.390416666666667
Month-Day: 0505 Max Temp: 12.22
Month-Day: 0505 Min Temp: 1.11
Month-Day: 0505 Mean Temp: 6.905972222222221
Month-Day: 0506 Max Temp: 1.67
Month-Day: 0506 Min Temp: -2.78
Month-Day: 0506 Mean Temp: -0.40138888888888885
Month-Day: 0507 Max Temp: 1.11
Month-Day: 0507 Min Temp: -6.11
Month-Day: 0507 Mean Temp: -1.7204166666666667
Month-Day: 0508 Max Temp: 1.11
Month-Day: 0508 Min Temp: -7.22
Month-Day: 0508 Mean Temp: -1.9401408450704225
Month-Day: 0509 Max Temp: 2.78
Month-Day: 0509 Min Temp: -2.78
Month-Day: 0509 Mean Temp: -0.6418309859154928
Month-Day: 0510 Max Temp: 1.67
Month-Day: 0510 Min Temp: -3.89
Month-Day: 0510 Mean Temp: -1.3301408450704224
Month-Day: 0511 Max Temp: 1.11
Month-Day: 0511 Min Temp: -3.89
Month-Day: 0511 Mean Temp: -1.5973611111111112
Month-Day: 0512 Max Temp: 2.78
Month-Day: 0512 Min Temp: -3.89
Month-Day: 0512 Mean Temp: -0.3163888888888889
Month-Day: 0513 Max Temp: 2.78
Month-Day: 0513 Min Temp: -2.78
Month-Day: 0513 Mean Temp: -0.2630555555555555
Month-Day: 0514 Max Temp: 2.78
Month-Day: 0514 Min Temp: -3.89
Month-Day: 0514 Mean Temp: 0.4238888888888889
Month-Day: 0515 Max Temp: 4.44
Month-Day: 0515 Min Temp: -2.78
Month-Day: 0515 Mean Temp: 1.423943661971831
Month-Day: 0516 Max Temp: 7.78
Month-Day: 0516 Min Temp: -1.67
Month-Day: 0516 Mean Temp: 3.6187500000000004
Month-Day: 0517 Max Temp: 3.33
Month-Day: 0517 Min Temp: 1.11
Month-Day: 0517 Mean Temp: 2.6083333333333334
Month-Day: 0518 Max Temp: 11.11
Month-Day: 0518 Min Temp: 1.11
Month-Day: 0518 Mean Temp: 5.254722222222223
Month-Day: 0519 Max Temp: 8.89
Month-Day: 0519 Min Temp: 3.33
Month-Day: 0519 Mean Temp: 6.189154929577465
Month-Day: 0520 Max Temp: 6.67
Month-Day: 0520 Min Temp: 2.22
Month-Day: 0520 Mean Temp: 4.508285714285713
Month-Day: 0521 Max Temp: 10.0
Month-Day: 0521 Min Temp: 2.22
Month-Day: 0521 Mean Temp: 6.605277777777777
Month-Day: 0522 Max Temp: 12.22
Month-Day: 0522 Min Temp: 5.0
Month-Day: 0522 Mean Temp: 8.510694444444445
Month-Day: 0523 Max Temp: 8.33
Month-Day: 0523 Min Temp: 1.11
Month-Day: 0523 Mean Temp: 5.77138888888889
Month-Day: 0524 Max Temp: 12.78
Month-Day: 0524 Min Temp: 1.11
Month-Day: 0524 Mean Temp: 8.440972222222221
Month-Day: 0525 Max Temp: 15.0
Month-Day: 0525 Min Temp: 2.22
Month-Day: 0525 Mean Temp: 8.788472222222222
Month-Day: 0526 Max Temp: 6.11
Month-Day: 0526 Min Temp: -1.11
Month-Day: 0526 Mean Temp: 3.380422535211268
Month-Day: 0527 Max Temp: 5.0
Month-Day: 0527 Min Temp: 0.0
Month-Day: 0527 Mean Temp: 2.5231944444444445
Month-Day: 0528 Max Temp: 3.33
Month-Day: 0528 Min Temp: 0.0
Month-Day: 0528 Mean Temp: 1.519861111111111
Month-Day: 0529 Max Temp: 6.67
Month-Day: 0529 Min Temp: 0.0
Month-Day: 0529 Mean Temp: 3.5747826086956525
Month-Day: 0530 Max Temp: 8.33
Month-Day: 0530 Min Temp: -1.11
Month-Day: 0530 Mean Temp: 5.139027777777778
Month-Day: 0531 Max Temp: 7.22
Month-Day: 0531 Min Temp: -1.11
Month-Day: 0531 Mean Temp: 3.5413888888888887